documentation/Examples/ExcelDataProvider/Excel Data Provider.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3.20171014">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="SET DATA FILE PATH" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PATH" elementType="Argument">
            <stringProp name="Argument.name">PATH</stringProp>
            <stringProp name="Argument.value">${__BeanShell(import org.apache.jmeter.gui.GuiPackage;
import org.apache.commons.io.FilenameUtils;
String testPlanFile = GuiPackage.getInstance().getTestPlanFile();
String testPlanFileDir = FilenameUtils.getFullPathNoEndSeparator(testPlanFile);
return testPlanFileDir;
)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <org.qamation.jmeter.data.provider.config.ExcelDataConfig guiclass="TestBeanGUI" testclass="org.qamation.jmeter.data.provider.config.ExcelDataConfig" testname="Excel Data Provider Config For All" enabled="true">
        <stringProp name="filename">${PATH}/Excel_Data_All.xlsx</stringProp>
        <stringProp name="dataProviderImplClassName">org.qamation.data.provider.DataProviderExcelAdapter</stringProp>
        <boolProp name="resetAtEOF">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <stringProp name="tabNumber">0</stringProp>
        <stringProp name="fieldNames">all1,all2,all3</stringProp>
        <boolProp name="isFirstLineHeader">true</boolProp>
      </org.qamation.jmeter.data.provider.config.ExcelDataConfig>
      <hashTree/>
      <org.qamation.jmeter.data.provider.config.ExcelDataConfig guiclass="TestBeanGUI" testclass="org.qamation.jmeter.data.provider.config.ExcelDataConfig" testname="Excel Data Provider Config For Group" enabled="true">
        <stringProp name="filename">${PATH}/Excel_Data_Group.xlsx</stringProp>
        <stringProp name="dataProviderImplClassName">org.qamation.data.provider.DataProviderExcelAdapter</stringProp>
        <boolProp name="resetAtEOF">true</boolProp>
        <boolProp name="resetAtTestStart">true</boolProp>
        <stringProp name="shareMode">shareMode.group</stringProp>
        <stringProp name="tabNumber">0</stringProp>
        <boolProp name="isFirstLineHeader">true</boolProp>
        <stringProp name="fieldNames">gr1,gr2,gr3</stringProp>
      </org.qamation.jmeter.data.provider.config.ExcelDataConfig>
      <hashTree/>
      <org.qamation.jmeter.data.provider.config.ExcelDataConfig guiclass="TestBeanGUI" testclass="org.qamation.jmeter.data.provider.config.ExcelDataConfig" testname="Excel Data Provider Config For a Thread" enabled="true">
        <stringProp name="filename">${PATH}/Excel_Data_Thread.xlsx</stringProp>
        <stringProp name="dataProviderImplClassName">org.qamation.data.provider.DataProviderExcelAdapter</stringProp>
        <boolProp name="resetAtEOF">true</boolProp>
        <boolProp name="resetAtTestStart">true</boolProp>
        <stringProp name="shareMode">shareMode.thread</stringProp>
        <stringProp name="tabNumber">0</stringProp>
        <boolProp name="isFirstLineHeader">true</boolProp>
        <stringProp name="fieldNames">th1,th2,th3</stringProp>
      </org.qamation.jmeter.data.provider.config.ExcelDataConfig>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="VIEW RESULTS" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
        <collectionProp name="UserParameters.names">
          <stringProp name="957830652">counter</stringProp>
        </collectionProp>
        <collectionProp name="UserParameters.thread_values">
          <collectionProp name="-1879318585">
            <stringProp name="4324069">${__counter(TRUE)}</stringProp>
          </collectionProp>
          <collectionProp name="-1879318585">
            <stringProp name="4324069">${__counter(TRUE)}</stringProp>
          </collectionProp>
          <collectionProp name="-1879318585">
            <stringProp name="4324069">${__counter(TRUE)}</stringProp>
          </collectionProp>
        </collectionProp>
        <boolProp name="UserParameters.per_iteration">true</boolProp>
      </UserParameters>
      <hashTree/>
      <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
        <collectionProp name="UserParameters.names">
          <stringProp name="1797724404">GL-COUNTER</stringProp>
        </collectionProp>
        <collectionProp name="UserParameters.thread_values">
          <collectionProp name="-1679889557">
            <stringProp name="99330740">${__counter(FALSE)}</stringProp>
          </collectionProp>
        </collectionProp>
        <boolProp name="UserParameters.per_iteration">true</boolProp>
      </UserParameters>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">3</stringProp>
        <longProp name="ThreadGroup.start_time">1509931443000</longProp>
        <longProp name="ThreadGroup.end_time">1509931443000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Iter: ${GL-COUNTER}   ${__BeanShell(import org.apache.jmeter.threads.JMeterContext;import org.apache.jmeter.threads.JMeterContextService;return JMeterContextService.getContext().getThread().getThreadName();)}  ${counter} " enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>